app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $db = \Config\Database::connect();

        // 1. Hitung Total Pendapatan (SUM dari kolom total_payment di tabel orders yang statusnya 'Selesai')
        $pendapatanQuery = $db->table('orders')
                             ->selectSum('total_payment')
                             ->where('order_status', 'Selesai')
                             ->get()
                             ->getRowArray();
        $data['total_pendapatan'] = $pendapatanQuery['total_payment'] ?? 0;

        // 2. Hitung Total Pesanan (COUNT semua baris yang ada di tabel orders)
        $data['total_pesanan'] = $db->table('orders')->countAllResults();

        // 3. Hitung Total Pelanggan (COUNT semua pelanggan unik dari tabel orders/pelanggan)
        // Jika kelompokmu punya tabel khusus 'customers', ganti 'orders' menjadi 'customers'
        $data['total_pelanggan'] = $db->table('orders')->distinct()->select('customer_name')->countAllResults();

        // 4. Hitung Total Menu (COUNT semua menu makanan & minuman yang aktif dari tabel menus)
        $data['total_menu'] = $db->table('menus')->where('is_active', 1)->countAllResults();

        // 5. Ambil 5 data Antrean Pesanan Terbaru untuk dipajang di tabel dashboard
        $data['orders'] = $db->table('orders')
                             ->orderBy('id', 'DESC')
                             ->limit(5)
                             ->get()
                             ->getResultArray();
---
SELECT SUM(`total_payment`) AS `total_payment`
FROM `orders`
WHERE `order_status` = 'Selesai'
SELECT COUNT(*) AS `numrows`
FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `customer_name`
FROM `orders`
) CI_count_all_results
SELECT COUNT(*) AS `numrows`
FROM `menus`
WHERE `is_active` = 1
SELECT *
FROM `orders`
ORDER BY `id` DESC
 LIMIT 5

    public function pesanan()
    {
        $db = \Config\Database::connect();

        // Tangkap status dari link URL yang diklik
        $statusFilter = $this->request->getGet('status');

        $builder = $db->table('orders');

        // Jika status diklik (tidak kosong), filter datanya berdasarkan status tersebut
        if (!empty($statusFilter)) {
            $builder->where('order_status', $statusFilter);
        }

        $data['orders'] = $builder->orderBy('id', 'DESC')->get()->getResultArray();
---
SELECT *
FROM `orders`
ORDER BY `id` DESC

    public function menu()
    {
        $db = \Config\Database::connect();

        // Menggabungkan tabel menus dan categories berdasarkan ID kategorinya
        $query = $db->table('menus')
                    ->select('menus.*, categories.category_name')
                    ->join('categories', 'categories.id = menus.category_id', 'left')
                    ->get();
---
SELECT `menus`.*, `categories`.`category_name`
FROM `menus`
LEFT JOIN `categories` ON `categories`.`id` = `menus`.`category_id`

    public function transaksi()
    {
        $db = \Config\Database::connect();

        // Menarik data transaksi/pesanan yang sudah selesai atau lunas dari database
        $data['daftar_transaksi'] = $db->table('orders')
                                       ->where('order_status', 'Selesai')
                                       ->orderBy('id', 'DESC')
                                       ->get()
                                       ->getResultArray();
---
SELECT *
FROM `orders`
WHERE `order_status` = 'Selesai'
ORDER BY `id` DESC

    public function laporan()
    {
        $db = \Config\Database::connect();

        // 1. Ambil filter tanggal dari inputan (jika ada)
        $tgl_mulai = $this->request->getGet('tgl_mulai') ?? date('Y-m-01');
        $tgl_selesai = $this->request->getGet('tgl_selesai') ?? date('Y-m-d');

        // 2. Query menghitung ringkasan total omzet kotor (SUM dari total_payment)
        $ringkasan = $db->table('orders')
                        ->selectSum('total_payment', 'omzet')
                        ->where('order_status', 'Selesai')
                        ->where('DATE(created_at) >=', $tgl_mulai)
                        ->where('DATE(created_at) <=', $tgl_selesai)
                        ->get()
                        ->getRowArray();

        $data['total_omzet'] = $ringkasan['omzet'] ?? 0;

        // 3. Menghitung Pajak Resto / PPN 10% langsung lewat matematika PHP (Biar aman dari eror struktur database)
        // Rumus: Total Pajak = Omzet Kotor * 10%
        $data['total_pajak'] = $data['total_omzet'] * 0.1;

        // 4. Hitung jumlah total nota lunas
        $data['total_transaksi'] = $db->table('orders')
                                      ->where('order_status', 'Selesai')
                                      ->where('DATE(created_at) >=', $tgl_mulai)
                                      ->where('DATE(created_at) <=', $tgl_selesai)
                                      ->countAllResults();

        // 5. Ambil data rincian baris transaksi untuk tabel laporan omzet
        $data['laporan_penjualan'] = $db->table('orders')
                                        ->where('order_status', 'Selesai')
                                        ->where('DATE(created_at) >=', $tgl_mulai)
                                        ->where('DATE(created_at) <=', $tgl_selesai)
                                        ->orderBy('id', 'DESC')
                                        ->get()
                                        ->getResultArray();
---
SELECT SUM(`total_payment`) AS `omzet`
FROM `orders`
WHERE `order_status` = 'Selesai'
AND DATE(created_at) >= '2026-06-01'
AND DATE(created_at) <= '2026-06-29'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `order_status` = 'Selesai'
AND DATE(created_at) >= '2026-06-01'
AND DATE(created_at) <= '2026-06-29'
SELECT *
FROM `orders`
WHERE `order_status` = 'Selesai'
AND DATE(created_at) >= '2026-06-01'
AND DATE(created_at) <= '2026-06-29'
ORDER BY `id` DESC