app/Controllers/Admin.php

    public function index()
    {
        $data['orders'] = $this->orderModel
            ->select('orders.*, tables.table_number, tables.type as table_type')
            ->join('tables', 'tables.id = orders.table_id')
            ->orderBy('orders.created_at', 'DESC')
            ->findAll();
---
SELECT `orders`.*, `tables`.`table_number`, `tables`.`type` as `table_type`
FROM `orders`
JOIN `tables` ON `tables`.`id` = `orders`.`table_id`
ORDER BY `orders`.`created_at` DESC