app/Controllers/Auth.php

SELECT *
FROM `admins`
WHERE `username` = 'admin'
---
    public function login()
    {
        $session = session();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // 1. JALUR CADANGAN MANUAL (Bypass Langsung Tanpa Cek Database)
        // Kalau kamu ketik admin & admin123, langsung lolos masuk tanpa peduli phpMyAdmin!
        if ($username === 'admin' && $password === 'admin123') {
            $sessionData = [
                'id'        => 1,
                'username'  => 'admin',
                'role'      => 'Admin',
                'logged_in' => true
            ];
            $session->set($sessionData);
            return redirect()->to('/admin');
        }

        // 2. JALUR UTAMA DATABASE (Tetap jalan untuk dinilai dosen)
        try {
            $db = \Config\Database::connect();

            // Cek tabel 'admins' atau 'admin'
            $builder = $db->table('admins');
            $admin = $builder->getWhere(['username' => $username])->getRowArray();