app/Controllers/Cart.php

    public function checkout()
    {
        $session = session();
        $cart = $session->get('cart') ?? [];

        // Kalau keranjang kosong, kembalikan ke halaman keranjang
        if (empty($cart)) {
            return redirect()->to(base_url('cart'))->with('error', 'Keranjang belanja masih kosong!');
        }

        // Hitung subtotal pesanan
        $subtotal = 0;
        foreach ($cart as $item) {
            $subtotal += $item['price'] * $item['quantity'];
        }

        // Ambil data meja yang statusnya 'Tersedia' dari database
        $db = \Config\Database::connect();
        $tables = $db->table('tables')->where('status', 'Tersedia')->get()->getResultArray();
---
SELECT *
FROM `tables`
WHERE `status` = 'Tersedia'