app/Controllers/Home.php

    public function index()
    {
        // Inisialisasi model
        $menuModel = new MenuModel();
        $categoryModel = new CategoryModel();

        // 1. Ambil semua kategori untuk bagian tab filter
        $data['categories'] = $categoryModel->findAll();

        // 2. Ambil menu yang diberi tanda rekomendasi (is_recommended = 1) dan berstatus aktif
        $data['recommended_menus'] = $menuModel->where('is_recommended', 1)
                                                ->where('is_active', 1)
                                                ->findAll();

        // 3. Ambil semua menu yang aktif untuk etalase utama
        $data['all_menus'] = $menuModel->where('is_active', 1)->findAll();
---
SELECT *
FROM `categories`
SELECT *
FROM `menus`
WHERE `is_recommended` = 1
AND `is_active` = 1
SELECT *
FROM `menus`
WHERE `is_active` = 1